app/controllers/social_medium_controller.rb

  def edit
    @user = User.find_by_name(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Example-User"], ["LIMIT", 1]]

  def update
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]