app/controllers/users_controller.rb

SELECT  "users".* FROM "users" INNER JOIN (SELECT "users"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("users"."name"::text, ''))), (to_tsquery('simple', ''' ' || 'chuck' || ' ''' || ':*')), 0)) AS rank FROM "users" WHERE (((to_tsvector('simple', coalesce("users"."name"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'chuck' || ' ''' || ':*'))))) AS pg_search_7dfb4cf67742cb0660305e ON "users"."id" = pg_search_7dfb4cf67742cb0660305e.pg_search_id ORDER BY pg_search_7dfb4cf67742cb0660305e.rank DESC, "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" INNER JOIN (SELECT "users"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("users"."name"::text, ''))), (to_tsquery('simple', ''' ' || 'chuck' || ' ''' || ':*')), 0)) AS rank FROM "users" WHERE (((to_tsvector('simple', coalesce("users"."name"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'chuck' || ' ''' || ':*'))))) AS pg_search_7dfb4cf67742cb0660305e ON "users"."id" = pg_search_7dfb4cf67742cb0660305e.pg_search_id
---
  def index
    # @users = User.paginate(page: params[:page])
    @users = if params[:term]
      User.search_by_full_name(params[:term]).paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Makayla"], ["LIMIT", 1]]
---
  def show
    # @user = User.find(params[:id])
    @user = User.find_by_name(params[:id].downcase) #find by username instead

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user_params[:name].downcase!
    @user = User.new(user_params)
		social = SocialMedium.new # create a blank instance of Social Media for this user
		@user.social_medium = social # create the relation
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Example-User99999"], ["password_digest", "$2a$10$j2l14SJQZrYT6UhFcNy4QO.EyREAu9oeAFXaqbQuO8jDoy/0emJqu"], ["updated_at", "2018-03-14 07:28:21.927047"], ["id", 1]]
---
  def update
    user_params[:name].downcase!
    @user = User.find(params[:id])
    @social = @user.social_medium
    if @user.update_attributes(user_params)